IDEA Connection Link
ConnectionSrv.StreamToByteArray Method
 StreamToByteArray
 Namespace: IdeaRS.ConnectionService.Service
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public static byte[] StreamToByteArray(
	Stream stream
)
Public Shared Function StreamToByteArray (
	stream As Stream
) As Byte()
public:
static array<unsigned char>^ StreamToByteArray(
	Stream^ stream
)
Parameters
stream
Type: System.IO.Stream
[Missing <param name="stream"/> documentation for "M:IdeaRS.ConnectionService.Service.ConnectionSrv.StreamToByteArray(System.IO.Stream)"]
Return Value
Type: Byte[]
[Missing <returns> documentation for "M:IdeaRS.ConnectionService.Service.ConnectionSrv.StreamToByteArray(System.IO.Stream)"]
See Also
Reference
ConnectionSrv Class
IdeaRS.ConnectionService.Service Namespace